# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes

activation: nn.ReLU()

# custom_n.yaml single scale fully reduced model
# YOLOv8-style lightweight custom model (nano baseline, slightly widened)
depth_multiple: 0.33
width_multiple: 0.32  # slightly wider than vanilla n (was ~0.28)
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [3, 16, 3, 2]]
  - [-1, 1, DWConv, [16, 32, 3, 2]]
  - [-1, 1, GhostC2fskip, [32, 32, 1, True]]
  - [-1, 1, ECA, [32]]    # replace heavy CBAM with ECA
  - [-1, 1, DWConv, [32, 56, 3, 2]]
  - [-1, 2, GhostC2fskip, [56, 56, 2, True]]
  - [-1, 1, ECA, [56]]
  - [-1, 1, DWConv, [56, 104, 3, 2]]
  - [-1, 2, GhostC2fskip, [104, 104, 2, True]]
  - [-1, 1, ECA, [104]]
  - [-1, 1, SPPF, [104, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #[-1, 1, nn.Upsample, [None, 2, "nearest"]] # Upsample
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, GhostC2f, [160, 104, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, GhostC2f, [160, 56, 1]]
  - [-1, 1, DWConv, [56, 56, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 1, GhostC2f, [160, 104, 1]]
  - [-1, 1, DWConv, [104, 104, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, GhostC2f, [208, 104, 1]]
  - [[15, 18, 21], 1, Detect, [nc]] 
