# custom_n.yaml (Fixed)
nc: 1
depth_multiple: 0.33
width_multiple: 0.25
activation: nn.ReLU()

backbone:
  - [-1, 1, Conv, [3, 16, 3, 2]]
  - [-1, 1, DWConv, [16, 32, 3, 2]]
  - [-1, 1, GhostC2fskip, [32, 32, 1, True]]
  - [-1, 1, ECA, [32]]
  - [-1, 1, DWConv, [32, 56, 3, 2]]
  - [-1, 2, GhostC2fskip, [56, 56, 2, True]]
  - [-1, 1, ECA, [56]]
  - [-1, 1, DWConv, [56, 104, 3, 2]]
  - [-1, 2, GhostC2fskip, [104, 104, 2, True]]
  - [-1, 1, ECA, [104]]
  - [-1, 1, SPPF, [104, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 11
  - [[-1, 6], 1, Concat, [1]]                         # 12 cat with stage 6
  - [-1, 1, GhostC2f, [160, 104, 1]]                  # 13
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 14
  - [[-1, 4], 1, Concat, [1]]                         # 15 cat with stage 4
  - [-1, 1, GhostC2f, [160, 56, 1]]                   # 16
  - [-1, 1, DWConv, [56, 56, 3, 2]]                   # 17
  - [[-1, 9], 1, Concat, [1]]                         # 18 cat with stage 9
  - [-1, 1, GhostC2f, [160, 104, 1]]                  # 19
  - [-1, 1, DWConv, [104, 104, 3, 2]]                 # 20
  - [[-1, 9], 1, Concat, [1]]                         # 21 cat with same backbone scale
  - [-1, 1, GhostC2f, [208, 104, 1]]                  # 22
  - [[13, 16, 19], 1, Detect, [nc]]                   # 23 Detect heads (multi-scale)
