activation: nn.ReLU()

# yolov8_eca_bifpn.yaml 
nc: 1
depth_multiple: 0.33
# width_multiple: 0.50

backbone:
  # [from, n, module, args]
  - [-1, 1, Conv,     [3,  32, 3, 2]]          # 0-P1/2
  - [-1, 1, DWConv,   [64, 3, 2]]              # 1-P2/4
  - [-1, 2, GhostC2f, [64, True]]              # 2
  - [-1, 1, ECA,      [64]]                    # 3
  - [-1, 1, DWConv,   [128, 3, 2]]             # 4-P3/8
  - [-1, 3, GhostC2f, [128, True]]             # 5
  - [-1, 1, ECA,      [128]]                   # 6
  - [-1, 1, DWConv,   [256, 3, 2]]             # 7-P4/16
  - [-1, 3, GhostC2f, [256, True]]             # 8
  - [-1, 1, ECA,      [256]]                   # 9
  - [-1, 1, DWConv,   [512, 3, 2]]             # 10-P5/32
  - [-1, 1, GhostC2f, [512, True]]             # 11
  - [-1, 1, ECA,      [512]]                   # 12
  - [-1, 1, SPPF,     [512, 5]]                # 13: output (P5)

head:
# --- Input Projections (Project P3, P4, P5 to a uniform 128-base-channel neck) ---
# This fixes the channel mismatches.
# (Scaled channels with 0.5 width_multiple will be 64)
- [6, 1, Conv, [128, 1, 1]]                 # 14: Project P3(6) (from 128*0.5=64ch) -> 64ch
- [9, 1, Conv, [128, 1, 1]]                 # 15: Project P4(9) (from 256*0.5=128ch) -> 64ch
- [13, 1, Conv, [128, 1, 1]]                # 16: Project P5(13) (from 512*0.5=256ch) -> 64ch

# --- Top-down path (all fusions are now 64ch + 64ch) ---
- [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 17: Upsample P5_proj(16) to P4 size
- [[-1, 15], 1, WeightedAdd, [128]]          # 18: Fuse P5_up(17) & P4_proj(15)
- [-1, 1, DWConv, [128, 3, 1]]               # 19
- [-1, 1, ECA, [128]]                        # 20 (This is P4_td)
- [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 21: Upsample P4_td(20) to P3 size
- [[-1, 14], 1, WeightedAdd, [128]]          # 22: Fuse P4_up(21) & P3_proj(14)
- [-1, 1, DWConv, [128, 3, 1]]               # 23
- [-1, 1, ECA, [128]]                        # 24 (This is P3_out, Detect Head 1)

# --- Bottom-up path (all fusions are now 64ch + 64ch) ---
- [-1, 1, DWConv, [128, 3, 2]]               # 25: Downsample P3_out(24) to P4 size
- [[-1, 20], 1, WeightedAdd, [128]]          # 26: Fuse P3_down(25) & P4_td(20)
- [-1, 1, DWConv, [128, 3, 1]]               # 27
- [-1, 1, ECA, [128]]                        # 28 (This is P4_out, Detect Head 2)
- [-1, 1, DWConv, [128, 3, 2]]               # 29: Downsample P4_out(28) to P5 size
- [[-1, 16], 1, WeightedAdd, [128]]          # 30: Fuse P4_down(29) & P5_proj(16)
- [-1, 1, DWConv, [128, 3, 1]]               # 31
- [-1, 1, ECA, [128]]                        # 32 (This is P5_out, Detect Head 3)

# --- Detection Heads ---
- [[24, 28, 32], 1, Detect, [nc]]            # 33: Connect all 3 output heads