activation: nn.ReLU()

# yolov8_eca_bifpn.yaml 
nc: 1
depth_multiple: 0.33
width_multiple: 0.50

backbone:
  # [from, n, module, args]
  - [-1, 1, Conv,     [3,  32, 3, 2]]          # 0-P1/2
  - [-1, 1, DWConv,   [64, 3, 2]]              # 1-P2/4
  - [-1, 2, GhostC2f, [64, True]]              # 2
  - [-1, 1, ECA,      [64]]                    # 3
  - [-1, 1, DWConv,   [128, 3, 2]]             # 4-P3/8
  - [-1, 3, GhostC2f, [128, True]]             # 5
  - [-1, 1, ECA,      [128]]                   # 6
  - [-1, 1, DWConv,   [256, 3, 2]]             # 7-P4/16
  - [-1, 3, GhostC2f, [256, True]]             # 8
  - [-1, 1, ECA,      [256]]                   # 9
  - [-1, 1, DWConv,   [512, 3, 2]]             # 10-P5/32
  - [-1, 1, GhostC2f, [512, True]]             # 11
  - [-1, 1, ECA,      [512]]                   # 12
  - [-1, 1, SPPF,     [512, 5]]                # 13: output (P5)

# BiFPN-Lite neck
head:
# Top-down fusion
- [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 14: NEW - Upsample P5(13) to match P4 size
- [[-1, 9], 1, WeightedAdd, [256]]           # 15: Fuse upsampled P5 (14) & P4 (9)
- [-1, 1, DWConv, [256, 3, 1]]               # 16
- [-1, 1, ECA, [256]]                        # 17
- [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 18: up -> P3 scale
- [[-1, 6], 1, WeightedAdd, [128]]           # 19: Fuse with P3 (6)
- [-1, 1, DWConv, [128, 3, 1]]               # 20
- [-1, 1, ECA, [128]]                        # 21 (P3 head output)

# Bottom-up fusion
- [-1, 1, DWConv, [128, 3, 2]]               # 22: down -> P4
- [[-1, 17], 1, WeightedAdd, [256]]          # 23: fuse with P4-fused (17)
- [-1, 1, DWConv, [256, 3, 1]]               # 24
- [-1, 1, ECA, [256]]                        # 25 (P4 head output)
- [-1, 1, DWConv, [256, 3, 2]]               # 26: down -> P5
- [[-1, 13], 1, WeightedAdd, [512]]          # 27: fuse with P5 (13)
- [-1, 1, DWConv, [512, 3, 1]]               # 28
- [-1, 1, ECA, [512]]                        # 29 (P5 head output)

# Detection heads (3 scales)
- [[21, 25, 29], 1, Detect, [nc]]            # 30: Connect all 3 heads