nc: 1  # number of classes
activation: nn.SiLU()
depth_multiple: 0.33
width_multiple: 0.40   # slightly wider than YOLOv8n for stability

backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [3, 16, 3, 2]]             # 0-P1/2
  - [-1, 1, DWConv, [16, 32, 3, 2]]          # 1-P2/4
  - [-1, 1, GhostC2fskip, [32, 32, 1, True]] # 2
  - [-1, 1, ECA, [32]]                       # 3
  - [-1, 1, DWConv, [32, 56, 3, 2]]          # 4-P3/8
  - [-1, 2, GhostC2fskip, [56, 56, 2, True]] # 5
  - [-1, 1, ECA, [56]]                       # 6
  - [-1, 1, DWConv, [56, 104, 3, 2]]         # 7-P4/16
  - [-1, 3, GhostC2fskip, [104, 104, 2, True]] # 8 main feature level (P4)
  - [-1, 1, ECA, [104]]                      # 9
  - [-1, 1, SPPF, [104, 5]]                  # 10 context expansion (stride 16)
  
head:
  # no multi-scale FPN/PAN → direct single head
  - [-1, 1, GhostC2f, [104, 104, 1]]         # 11 refinement before detect
  - [-1, 1, ECA, [104]]                      # 12 lightweight attention
  - [[-1], 1, Detect, [nc]]                  # 13 single-scale detect (stride 16)